## CheatSheet - Exploración de datos usando Pandas

In [79]:
import pandas as pd

## 1.Lectura de los datos

In [80]:
data = pd.read_csv("titanic_train.csv")

## 2.Obtener una primera vista de los datos

In [81]:
data.shape #tamaño del dataset

(891, 12)

In [82]:
data.columns #columnas del dataset

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [83]:
data.dtypes #tipo de datos de las columnas

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [84]:
data.head(2) #visualizar las dos primeras filas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [85]:
data.tail(2) #visualizar las dos ultimas filas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [86]:
data.sample(2) #visualizar dos filas de forma aleatoria

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
82,83,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,330932,7.7875,NaN,Q
333,334,0,3,"Vander Planke, Mr. Leo Edmondus",male,16.0,2,0,345764,18.0000,NaN,S

In [87]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## 3.Modificar el tipo de datos de una columna

In [88]:
data["Fare"] = data["Fare"].astype("int64")

In [89]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare             int64
Cabin           object
Embarked        object
dtype: object

## 4.Renombrar una columna

In [90]:
data.rename(columns={"PassengerId": "ID"}, inplace = True) 
#para generar el cambio en nuestro dataset utilizamos'inplace = True'

## 5.Ordenar

In [91]:
data.sort_values("ID")

,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7,NaN,Q

## 6.Seleccionar y filtrar

In [92]:
data[['Name','Age']].sample(5)
#con los corchetes y nombres de columnas podemos acceder a un subconjunto del dataset

                           Name   Age
121  Moore, Mr. Leonard Charles   NaN
482    Rouse, Mr. Richard Henry  50.0
853   Lines, Miss. Mary Conover  16.0
69            Kink, Mr. Vincenz  26.0
434   Silvey, Mr. William Baird  50.0

In [93]:
data[data["Fare"] > 400] #filtramos los valores de la columna Fare mayores a 400

,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512,B101,C

In [94]:
data.query('Fare  > 400 ') # tambien podemos utilozar el método query

,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512,B101,C

Pandas provee un método general muy versátil para seleccionar elementos en base a las etiquetas. 
Esto se hace a través del atributo .loc.

In [95]:
boletos_3era_clase = data.loc[data['Pclass'] == 3,['Name','Fare']]

In [96]:
boletos_3era_clase
#Obtenemos el nombre y la tarifa abonada por los pasajeros que viajaron en 3era clase

                                         Name  Fare
0                     Braund, Mr. Owen Harris     7
2                      Heikkinen, Miss. Laina     7
4                    Allen, Mr. William Henry     8
5                            Moran, Mr. James     8
7              Palsson, Master. Gosta Leonard    21
..                                        ...   ...
882              Dahlberg, Miss. Gerda Ulrika    10
884                    Sutehall, Mr. Henry Jr     7
885      Rice, Mrs. William (Margaret Norton)    29
888  Johnston, Miss. Catherine Helen "Carrie"    23
890                       Dooley, Mr. Patrick     7

[491 rows x 2 columns]

A su vez existe el método iloc para acceder a los elementos según las posiciones. En este caso los
números representan las posiciones y no las etiquetas.

In [97]:
data.iloc[125,4] #fila 125 columna 4

'male'

## 7.Chequear duplicados

In [98]:
data.duplicated().sum(axis = 0)

0

## 8.Manejo de valores faltantes

Obtener valores faltantes

In [99]:
data.isnull().sum(axis = 0)

ID            0
Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

Rellenar los valores faltantes de la columna edad con la media

In [100]:
media_edad = round(data['Age'].mean()) #Obtenemos la media de la columna edad 
media_edad

30

In [101]:
data['Age'].fillna(media_edad, inplace=True) #Reemplazamos los valores nulos de la columna edad por la media de la edad

In [102]:
print(data.isnull().sum(axis = 0)) #Chequeamos que ya no existan valores nulos en la columna edad

ID            0
Survived      0
Pclass        0
Name          0
Sex           0
Age           0
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

## 9.Crear una nueva columna

In [103]:
data['Tarifa_con_impuestos'] = data['Fare'] * 1.25

In [104]:
data.head(3) #Chequeamos la nueva columna que creamos

,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Tarifa_con_impuestos
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7,NaN,S,8.75
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71,C85,C,88.75
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7,NaN,S,8.75

In [105]:
data = data.assign(Tarifa_con_impuestos_2 = data['Fare'] * 1.25 ) # opción 2

In [106]:
data.head(3)

,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Tarifa_con_impuestos,Tarifa_con_impuestos_2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7,NaN,S,8.75,8.75
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71,C85,C,88.75,88.75
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7,NaN,S,8.75,8.75

## 10. Identificar valores únicos

In [107]:
data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [108]:
data['Pclass'].unique()

array([3, 1, 2], dtype=int64)

## 11. Realizar cálculos y agrupaciones

In [109]:
# Edad promedio de los pasajeros de cada clase
round(data[['Pclass', 'Age']].groupby('Pclass').mean())

         Age
Pclass
1       37.0
2       30.0
3       26.0

In [110]:
# Cantidad de pasajeros por clase 
data[['Pclass', 'ID']].groupby('Pclass').count()

         ID
Pclass
1       216
2       184
3       491

In [111]:
#Cantidad de hombres 
(data['Sex'] == 'male').sum()

577

In [112]:
#Cantidad de no sobrevivientes 
(data['Survived'] == 0).sum()

549

## 12.Estadisticos basicos

In [113]:
#Este método nos da información sobre las variables numéricas, nos devuelve los estadisticos basicos
data.describe()

,ID,Survived,Pclass,Age,SibSp,Parch,Fare,Tarifa_con_impuestos,Tarifa_con_impuestos_2
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.758889,0.523008,0.381594,31.785634,39.732043,39.732043
std,257.353842,0.486592,0.836071,13.002570,1.102743,0.806057,49.703730,62.129662,62.129662
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.000000,8.750000,8.750000
50%,446.000000,0.000000,3.000000,30.000000,0.000000,0.000000,14.000000,17.500000,17.500000
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000,38.750000,38.750000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.000000,640.000000,640.000000

In [114]:
data_1 = data[['Survived', 'Age','Pclass','Fare']]

In [115]:
#Correlación por pares de columnas, excluyendo NA/valores nulos
data_1.corr( )

          Survived       Age    Pclass      Fare
Survived  1.000000 -0.070657 -0.338481  0.257482
Age      -0.070657  1.000000 -0.329727  0.090834
Pclass   -0.338481 -0.329727  1.000000 -0.550553
Fare      0.257482  0.090834 -0.550553  1.000000

## by Maria Belen Camandone